app/Services/PostCatalogueService.php

delete from `post_catalogue_language` where `post_catalogue_language`.`post_catalogue_id` = 56 and `post_catalogue_language`.`language_id` in (11, '56')
---
    public function update($request, $id)
    {
        DB::beginTransaction();
        try {
            $postCatalogue = $this->postCatalogueRepository->findById($id);
            $payload = $request->only($this->payload());
            $flag = $this->postCatalogueRepository->update($payload, $id);

            if ($flag === TRUE) {
                $payloadLanguage = $request->only($this->payloadLanguage());
                $payloadLanguage['language_id'] = $this->currentLanguage();
                $payloadLanguage['post_catalogue_id'] = $id;
                $postCatalogue->languages()->detach([
                    $payloadLanguage['language_id'],
                    $id
                ]);