app/Models/PostCatalogue.php

select * from `post_catalogues` where `post_catalogues`.`id` = '75' and `post_catalogues`.`deleted_at` is null limit 1
---
    public static function isNodeCheck($id = 0)
    {
        $postCatalogue = PostCatalogue::find($id);