app/Repositories/UserRepository.php

    public function pagination(array $column = ['*'], array $condition = [], int $perPage = 10, array $orderBy = [], array $extend = [], array $join = [], array $relations = [], array $where = [])
    {
        $query = $this->model->select($column)->where(function ($query) use ($condition) {
            if (isset($condition['keyword']) && !empty($condition['keyword'])) {
                $query->where('name', 'LIKE', '%' . $condition['keyword'] . '%')
                    ->orWhere('email', 'LIKE', '%' . $condition['keyword'] . '%')
                    ->orWhere('phone', 'LIKE', '%' . $condition['keyword'] . '%');
            }

            if (isset($condition['publish']) && $condition['publish'] != 0) {
                $query->where('publish', '=', $condition['publish']);
            }
            return $query;
        })->with('user_catalogues');
---
select * from `user_catalogues` where `user_catalogues`.`id` in (12) and `user_catalogues`.`deleted_at` is null

    public function getUserCatalogue()
    {
        $userCatalogue = UserCatalogue::all();
---
select * from `user_catalogues` where `user_catalogues`.`deleted_at` is null